In [2]:
import pandas as pd
import numpy as np

In [3]:
# To open csv files
df = pd.read_csv("data.csv")
df.head(20)

    Gender  Height  Weight  Index
0     Male     174      96      4
1     Male     189      87      2
2   Female     185     110      4
3   Female     195     104      3
4     Male     149      61      3
5     Male     189     104      3
6     Male     147      92      5
7     Male     154     111      5
8     Male     174      90      3
9   Female     169     103      4
10    Male     195      81      2
11  Female     159      80      4
12  Female     192     101      3
13    Male     155      51      2
14    Male     191      79      2
15  Female     153     107      5
16  Female     157     110      5
17    Male     140     129      5
18    Male     144     145      5
19    Male     172     139      5

## Finding the statistical data in the the data frame

In [4]:
df.describe()

           Height      Weight       Index
count  500.000000  500.000000  500.000000
mean   169.944000  106.000000    3.748000
std     16.375261   32.382607    1.355053
min    140.000000   50.000000    0.000000
25%    156.000000   80.000000    3.000000
50%    170.500000  106.000000    4.000000
75%    184.000000  136.000000    5.000000
max    199.000000  160.000000    5.000000

## Accessing a particular row or column

In [5]:
df.iloc[2:3, :]

   Gender  Height  Weight  Index
2  Female     185     110      4

In [6]:
df.iloc[1:2, 1:2]

   Height
1     189

In [7]:
df.iloc[4:5, 2:3]

   Weight
4      61

In [8]:
df.iloc[4][2]

61

In [9]:
df.columns

Index(['Gender', 'Height', 'Weight', 'Index'], dtype='object')

In [10]:
df.columns.get_loc('Height')

1

## Slicing a data frame

In [11]:
df.iloc[4:15, 1:3]

    Height  Weight
4      149      61
5      189     104
6      147      92
7      154     111
8      174      90
9      169     103
10     195      81
11     159      80
12     192     101
13     155      51
14     191      79

## Sorting a Data Frame

In [12]:
df.sort_values(by = 'Weight', ascending = True)

     Gender  Height  Weight  Index
85     Male     198      50      0
269    Male     168      50      1
150  Female     196      50      0
492  Female     198      50      0
99   Female     190      50      0
..      ...     ...     ...    ...
157    Male     168     160      5
330  Female     164     160      5
106    Male     166     160      5
204    Male     145     160      5
287    Male     178     160      5

[500 rows x 4 columns]

In [13]:
df.sort_values(by = 'Gender', ascending = False)

     Gender  Height  Weight  Index
0      Male     174      96      4
279    Male     188      57      1
277    Male     190      80      2
274    Male     178      83      3
271    Male     152     103      5
..      ...     ...     ...    ...
294  Female     168     143      5
293  Female     165      83      4
292  Female     162      68      3
95   Female     170     156      5
75   Female     197     154      4

[500 rows x 4 columns]

# Operations

## Finding the shape of a data frame

In [14]:
df.shape

(500, 4)

## Dropping unwanted columns

In [15]:
df_dropped = df.drop(columns = ['Index'])

In [16]:
df_dropped

     Gender  Height  Weight
0      Male     174      96
1      Male     189      87
2    Female     185     110
3    Female     195     104
4      Male     149      61
..      ...     ...     ...
495  Female     150     153
496  Female     184     121
497  Female     141     136
498    Male     150      95
499    Male     173     131

[500 rows x 3 columns]

In [19]:
df_1 = df.drop(columns = ['Height', 'Weight'])

In [20]:
df_1

     Gender  Index
0      Male      4
1      Male      2
2    Female      4
3    Female      3
4      Male      3
..      ...    ...
495  Female      5
496  Female      4
497  Female      5
498    Male      5
499    Male      5

[500 rows x 2 columns]

## Converting a Data Frame into a NumPy Array

In [22]:
x = df.values

In [23]:
x

array([['Male', 174, 96, 4],
       ['Male', 189, 87, 2],
       ['Female', 185, 110, 4],
       ...,
       ['Female', 141, 136, 5],
       ['Male', 150, 95, 5],
       ['Male', 173, 131, 5]], dtype=object)

## Converting a Numpy Array into a Data Frame

In [26]:
y = np.array([[1, 2], [4, 5], [6, 3]])

In [27]:
y.shape

(3, 2)

In [29]:
new_df = pd.DataFrame(y, columns = ('Num1', 'Num2'))

In [30]:
new_df

   Num1  Num2
0     1     2
1     4     5
2     6     3